tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65j15_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F65J15_H_
#define _PIC18F65J15_H_

#define SSP2CON2                      0
#define SEN2                          1
#define SSP2CON2_SEN                  2
#define ADMSK12                       3
#define SSP2CON2_RSEN                 4
#define RSEN2                         5
#define SSP2CON2_ADMSK1               6
#define ADMSK22                       7
#define PEN2                          8
#define SSP2CON2_PEN                  9
#define SSP2CON2_ADMSK2               10
#define ADMSK32                       11
#define SSP2CON2_RCEN                 12
#define RCEN2                         13
#define SSP2CON2_ADMSK3               14
#define ACKEN2                        15
#define ADMSK42                       16
#define SSP2CON2_ADMSK4               17
#define SSP2CON2_ACKEN                18
#define ACKDT2                        19
#define ADMSK52                       20
#define SSP2CON2_ACKDT                21
#define SSP2CON2_ADMSK5               22
#define SSP2CON2_ACKSTAT              23
#define ACKSTAT2                      24
#define SSP2CON2_GCEN                 25
#define GCEN2                         26
#define SSP2CON1                      27
#define SSP2CON1_SSPM                 28
#define SSP2CON1_SSPM0                29
#define SSPM02                        30
#define SSPM12                        31
#define SSP2CON1_SSPM1                32
#define SSP2CON1_SSPM2                33
#define SSPM22                        34
#define SSPM32                        35
#define SSP2CON1_SSPM3                36
#define SSP2CON1_CKP                  37
#define CKP2                          38
#define SSPEN2                        39
#define SSP2CON1_SSPEN                40
#define SSPOV2                        41
#define SSP2CON1_SSPOV                42
#define WCOL2                         43
#define SSP2CON1_WCOL                 44
#define SSP2STAT                      45
#define SSP2STAT_BF                   46
#define BF2                           47
#define SSP2STAT_UA                   48
#define UA2                           49
#define SSP2STAT_R_W                  50
#define RW2                           51
#define SSP2STAT_R                    52
#define SSP2STAT_nWRITE               53
#define SSP2STAT_nW                   54
#define READ_WRITE2                   55
#define nW2                           56
#define SSP2STAT_I2C_READ             57
#define I2C_READ2                     58
#define SSP2STAT_R_NOT_W              59
#define R_nW2                         60
#define SSP2STAT_READ_WRITE           61
#define nWRITE2                       62
#define R_W2                          63
#define SSP2STAT_R_nW                 64
#define SSP2STAT_NOT_WRITE            65
#define SSP2STAT_S                    66
#define S2                            67
#define START2                        68
#define SSP2STAT_I2C_START            69
#define I2C_START2                    70
#define P2                            71
#define SSP2STAT_I2C_STOP             72
#define STOP2                         73
#define SSP2STAT_P                    74
#define I2C_STOP2                     75
#define I2C_DAT2                      76
#define SSP2STAT_D                    77
#define DATA_ADDRESS2                 78
#define SSP2STAT_D_NOT_A              79
#define SSP2STAT_I2C_DAT              80
#define D_A2                          81
#define SSP2STAT_NOT_ADDRESS          82
#define SSP2STAT_D_nA                 83
#define SSP2STAT_DATA_ADDRESS         84
#define SSP2STAT_nADDRESS             85
#define nA2                           86
#define DA2                           87
#define nADDRESS2                     88
#define SSP2STAT_nA                   89
#define SSP2STAT_D_A                  90
#define D_nA2                         91
#define SSP2STAT_CKE                  92
#define CKE2                          93
#define SSP2STAT_SMP                  94
#define SMP2                          95
#define SSP2ADD                       96
#define MSK02                         97
#define MSK12                         98
#define MSK22                         99
#define MSK32                         100
#define MSK42                         101
#define MSK52                         102
#define MSK62                         103
#define MSK72                         104
#define ECCP2DEL                      105
#define P2DC0                         106
#define ECCP2DEL_PDC0                 107
#define ECCP2DEL_PDC                  108
#define P2DC1                         109
#define ECCP2DEL_PDC1                 110
#define P2DC2                         111
#define ECCP2DEL_PDC2                 112
#define P2DC3                         113
#define ECCP2DEL_PDC3                 114
#define P2DC4                         115
#define ECCP2DEL_PDC4                 116
#define P2DC5                         117
#define ECCP2DEL_PDC5                 118
#define P2DC6                         119
#define ECCP2DEL_PDC6                 120
#define ECCP2DEL_PRSEN                121
#define P2RSEN                        122
#define ECCP2AS                       123
#define ECCP2AS_PSSBD                 124
#define ECCP2AS_PSSBD0                125
#define PSS2BD0                       126
#define ECCP2AS_PSSBD1                127
#define PSS2BD1                       128
#define PSS2AC0                       129
#define ECCP2AS_PSSAC0                130
#define ECCP2AS_PSSAC                 131
#define ECCP2AS_PSSAC1                132
#define PSS2AC1                       133
#define ECCP2AS_ECCPAS                134
#define ECCP2AS0                      135
#define ECCP2AS_ECCPAS0               136
#define ECCP2AS1                      137
#define ECCP2AS_ECCPAS1               138
#define ECCP2AS2                      139
#define ECCP2AS_ECCPAS2               140
#define ECCP2AS_ECCPASE               141
#define ECCP2ASE                      142
#define ECCP3DEL                      143
#define ECCP3DEL_PDC0                 144
#define P3DC0                         145
#define ECCP3DEL_PDC                  146
#define ECCP3DEL_PDC1                 147
#define P3DC1                         148
#define ECCP3DEL_PDC2                 149
#define P3DC2                         150
#define ECCP3DEL_PDC3                 151
#define P3DC3                         152
#define ECCP3DEL_PDC4                 153
#define P3DC4                         154
#define ECCP3DEL_PDC5                 155
#define P3DC5                         156
#define ECCP3DEL_PDC6                 157
#define P3DC6                         158
#define P3RSEN                        159
#define ECCP3DEL_PRSEN                160
#define ECCP3AS                       161
#define ECCP3AS_PSSBD0                162
#define PSS3BD0                       163
#define ECCP3AS_PSSBD                 164
#define ECCP3AS_PSSBD1                165
#define PSS3BD1                       166
#define ECCP3AS_PSSAC0                167
#define PSS3AC0                       168
#define ECCP3AS_PSSAC                 169
#define ECCP3AS_PSSAC1                170
#define PSS3AC1                       171
#define ECCP3AS_ECCPAS0               172
#define ECCP3AS_ECCPAS                173
#define ECCP3AS0                      174
#define ECCP3AS_ECCPAS1               175
#define ECCP3AS1                      176
#define ECCP3AS_ECCPAS2               177
#define ECCP3AS2                      178
#define ECCP3AS_ECCPASE               179
#define ECCP3ASE                      180
#define RCSTA2                        181
#define RCD82                         182
#define RX9D2                         183
#define RCSTA2_RCD8                   184
#define RCSTA2_RX9D                   185
#define RCSTA2_OERR                   186
#define OERR2                         187
#define FERR2                         188
#define RCSTA2_FERR                   189
#define ADDEN2                        190
#define RCSTA2_ADDEN                  191
#define RCSTA2_CREN                   192
#define CREN2                         193
#define SREN2                         194
#define RCSTA2_SREN                   195
#define RC92                          196
#define RCSTA2_nRC8                   197
#define RC8_92                        198
#define RCSTA2_RX9                    199
#define RCSTA2_NOT_RC8                200
#define RCSTA2_RC9                    201
#define RCSTA2_RC8_9                  202
#define RX92                          203
#define RCSTA2_SPEN                   204
#define SPEN2                         205
#define TXSTA2                        206
#define TXSTA2_TXD8                   207
#define TX9D2                         208
#define TXSTA2_TX9D                   209
#define TXD82                         210
#define TRMT2                         211
#define TXSTA2_TRMT                   212
#define BRGH2                         213
#define TXSTA2_BRGH                   214
#define SENDB2                        215
#define TXSTA2_SENDB                  216
#define TXSTA2_SYNC                   217
#define SYNC2                         218
#define TXEN2                         219
#define TXSTA2_TXEN                   220
#define TX8_92                        221
#define TX92                          222
#define TXSTA2_TX9                    223
#define TXSTA2_nTX8                   224
#define TXSTA2_NOT_TX8                225
#define TXSTA2_TX8_9                  226
#define TXSTA2_CSRC                   227
#define CSRC2                         228
#define CCP5CON                       229
#define CCP5M0                        230
#define CCP5M                         231
#define CCP5M1                        232
#define CCP5M2                        233
#define CCP5M3                        234
#define DCCP5Y                        235
#define DC5B0                         236
#define DC5B                          237
#define DC5B1                         238
#define DCCP5X                        239
#define CCP4CON                       240
#define CCP4M                         241
#define CCP4M0                        242
#define CCP4M1                        243
#define CCP4M2                        244
#define CCP4M3                        245
#define DCCP4Y                        246
#define DC4B0                         247
#define DC4B                          248
#define DCCP4X                        249
#define DC4B1                         250
#define T4CON                         251
#define T4CKPS0                       252
#define T4CKPS                        253
#define T4CKPS1                       254
#define TMR4ON                        255
#define T4OUTPS                       256
#define T4OUTPS0                      257
#define T4OUTPS1                      258
#define T4OUTPS2                      259
#define T4OUTPS3                      260
#define ECCP1DEL                      261
#define P1DC0                         262
#define ECCP1DEL_PDC0                 263
#define ECCP1DEL_PDC                  264
#define P1DC1                         265
#define ECCP1DEL_PDC1                 266
#define P1DC2                         267
#define ECCP1DEL_PDC2                 268
#define P1DC3                         269
#define ECCP1DEL_PDC3                 270
#define P1DC4                         271
#define ECCP1DEL_PDC4                 272
#define P1DC5                         273
#define ECCP1DEL_PDC5                 274
#define P1DC6                         275
#define ECCP1DEL_PDC6                 276
#define P1RSEN                        277
#define ECCP1DEL_PRSEN                278
#define BAUDCON2                      279
#define ABDEN2                        280
#define BAUDCON2_ABDEN                281
#define WUE2                          282
#define BAUDCON2_WUE                  283
#define BAUDCON2_BRG16                284
#define BRG162                        285
#define SCKP2                         286
#define BAUDCON2_SCKP                 287
#define TXCKP2                        288
#define BAUDCON2_RCMT                 289
#define BAUDCON2_RCIDL                290
#define RCMT2                         291
#define RCIDL2                        292
#define BAUDCON2_ABDOVF               293
#define ABDOVF2                       294
#define BAUDCON1                      295
#define BAUDCON1_ABDEN                296
#define ABDEN1                        297
#define BAUDCON1_WUE                  298
#define WUE1                          299
#define W4E                           300
#define BRG161                        301
#define BAUDCON1_BRG16                302
#define SCKP1                         303
#define CKTXP                         304
#define TXCKP                         305
#define BAUDCON1_SCKP                 306
#define TXCKP1                        307
#define BAUDCON1_RCMT                 308
#define RCMT1                         309
#define RCIDL1                        310
#define BAUDCON1_RCIDL                311
#define ABDOVF1                       312
#define BAUDCON1_ABDOVF               313
#define PORTA                         314
#define AN0                           315
#define PORTA_RA0                     316
#define ULPWUIN                       317
#define AN1                           318
#define PORTA_RA1                     319
#define AN2                           320
#define PORTA_RA2                     321
#define VREFM                         322
#define AN3                           323
#define PORTA_RA3                     324
#define VREFP                         325
#define PORTA_RA4                     326
#define T0CKI                         327
#define AN4                           328
#define PORTA_RA5                     329
#define LVDIN                         330
#define CLKO                          331
#define RA6                           332
#define OSC2                          333
#define PORTB                         334
#define INT0                          335
#define PORTB_RB0                     336
#define INT1                          337
#define PORTB_RB1                     338
#define INT2                          339
#define PORTB_RB2                     340
#define INT3                          341
#define CCP2_PA2                      342
#define PORTB_RB3                     343
#define KBI0                          344
#define PORTB_RB4                     345
#define KBI1                          346
#define PORTB_RB5                     347
#define PGC                           348
#define KBI2                          349
#define PORTB_RB6                     350
#define PGD                           351
#define KBI3                          352
#define PORTB_RB7                     353
#define PORTC                         354
#define T13CKI                        355
#define T1OSO                         356
#define PORTC_RC0                     357
#define CCP2                          358
#define T1OSI                         359
#define PA2                           360
#define PORTC_RC1                     361
#define CCP1                          362
#define PA1                           363
#define PORTC_RC2                     364
#define SCL                           365
#define SCK                           366
#define PORTC_RC3                     367
#define SDA                           368
#define SDI                           369
#define PORTC_RC4                     370
#define SDO                           371
#define PORTC_RC5                     372
#define TX                            373
#define CK                            374
#define PORTC_RC6                     375
#define DT                            376
#define RX                            377
#define PORTC_RC7                     378
#define PORTD                         379
#define PSP0                          380
#define PORTD_RD0                     381
#define PSP1                          382
#define PORTD_RD1                     383
#define PSP2                          384
#define PORTD_RD2                     385
#define PSP3                          386
#define PORTD_RD3                     387
#define PSP4                          388
#define SDO2                          389
#define PORTD_RD4                     390
#define PSP5                          391
#define SDI2                          392
#define SDA2                          393
#define PORTD_RD5                     394
#define PSP6                          395
#define SCK2                          396
#define SCL2                          397
#define PORTD_RD6                     398
#define SS2                           399
#define PSP7                          400
#define PORTD_RD7                     401
#define PORTE                         402
#define PD2                           403
#define RD                            404
#define RDE                           405
#define PORTE_RE0                     406
#define PORTE_WR                      407
#define WRE                           408
#define PORTE_RE1                     409
#define PC2                           410
#define CCP10                         411
#define PB2                           412
#define CS                            413
#define PORTE_RE2                     414
#define CCP9E                         415
#define PORTE_RE3                     416
#define PC3E                          417
#define PORTE_RE4                     418
#define PB3E                          419
#define CCP8E                         420
#define CCP7E                         421
#define PORTE_RE5                     422
#define PC1E                          423
#define CCP6E                         424
#define PORTE_RE6                     425
#define PB1E                          426
#define CCP2E                         427
#define PORTE_RE7                     428
#define PA2E                          429
#define PORTF                         430
#define PORTF_RF1                     431
#define C2OUTF                        432
#define AN6                           433
#define PORTF_RF2                     434
#define C1OUTF                        435
#define AN7                           436
#define PORTF_RF3                     437
#define CVREF                         438
#define AN8                           439
#define PORTF_RF4                     440
#define AN9                           441
#define PORTF_RF5                     442
#define AN10                          443
#define PORTF_RF6                     444
#define AN11                          445
#define SS                            446
#define PORTF_RF7                     447
#define PORTG                         448
#define CCP3                          449
#define PORTG_RG0                     450
#define C3OUTG                        451
#define CK2                           452
#define TX2                           453
#define PORTG_RG1                     454
#define RX2                           455
#define PORTG_RG2                     456
#define DT2                           457
#define CCP4                          458
#define PORTG_RG3                     459
#define CCP5                          460
#define PORTG_RG4                     461
#define REPU                          462
#define RG6                           463
#define RDPU                          464
#define RG7                           465
#define LATA                          466
#define LATA0                         467
#define LA0                           468
#define LATA1                         469
#define LA1                           470
#define LATA2                         471
#define LA2                           472
#define LATA3                         473
#define LA3                           474
#define LATA4                         475
#define LA4                           476
#define LATA5                         477
#define LA5                           478
#define LATB                          479
#define LB0                           480
#define LATB0                         481
#define LB1                           482
#define LATB1                         483
#define LB2                           484
#define LATB2                         485
#define LB3                           486
#define LATB3                         487
#define LB4                           488
#define LATB4                         489
#define LB5                           490
#define LATB5                         491
#define LB6                           492
#define LATB6                         493
#define LB7                           494
#define LATB7                         495
#define LATC                          496
#define LATC0                         497
#define LC0                           498
#define LATC1                         499
#define LC1                           500
#define LATC2                         501
#define LC2                           502
#define LATC3                         503
#define LC3                           504
#define LATC4                         505
#define LC4                           506
#define LATC5                         507
#define LC5                           508
#define LATC6                         509
#define LC6                           510
#define LATC7                         511
#define LC7                           512
#define LATD                          513
#define LATD0                         514
#define LD0                           515
#define LATD1                         516
#define LD1                           517
#define LATD2                         518
#define LD2                           519
#define LATD3                         520
#define LD3                           521
