tiborsimon/embedded-tdd-headers/pic/8bit/pic18f65j15_tdd.h
#define NOT_T1SYNC                    1091
#define T1SYNC                        1092
#define nT1SYNC                       1093
#define T1INSYNC                      1094
#define T1OSCEN                       1095
#define SOSCEN                        1096
#define T1CKPS0                       1097
#define T1CKPS                        1098
#define T1CKPS1                       1099
#define T1RUN                         1100
#define T1RD16                        1101
#define T1CON_RD16                    1102
#define RCON                          1103
#define BOR                           1104
#define NOT_BOR                       1105
#define nBOR                          1106
#define POR                           1107
#define nPOR                          1108
#define NOT_POR                       1109
#define nPD                           1110
#define NOT_PD                        1111
#define PD                            1112
#define NOT_TO                        1113
#define nTO                           1114
#define TO                            1115
#define nRI                           1116
#define NOT_RI                        1117
#define RI                            1118
#define IPEN                          1119
#define WDTCON                        1120
#define SWDTE                         1121
#define SWDTEN                        1122
#define OSCCON                        1123
#define SCS0                          1124
#define SCS                           1125
#define SCS1                          1126
#define OSTS                          1127
#define IDLEN                         1128
#define T0CON                         1129
#define T0PS                          1130
#define T0PS0                         1131
#define T0PS1                         1132
#define T0PS2                         1133
#define PSA                           1134
#define T0PS3                         1135
#define T0SE                          1136
#define T0CS                          1137
#define T08BIT                        1138
#define TMR0ON                        1139
#define STATUS                        1140
#define C                             1141
#define CARRY                         1142
#define DC                            1143
#define ZERO                          1144
#define Z                             1145
#define OV                            1146
#define OVERFLOW                      1147
#define N                             1148
#define NEGATIVE                      1149
#define INTCON3                       1150
#define INT1IF                        1151
#define INT1F                         1152
#define INT2IF                        1153
#define INT2F                         1154
#define INT3F                         1155
#define INT3IF                        1156
#define INT1E                         1157
#define INT1IE                        1158
#define INT2IE                        1159
#define INT2E                         1160
#define INT3E                         1161
#define INT3IE                        1162
#define INT1P                         1163
#define INT1IP                        1164
#define INT2IP                        1165
#define INT2P                         1166
#define INTCON2                       1167
#define RBIP                          1168
#define INT3IP                        1169
#define INT3P                         1170
#define TMR0IP                        1171
#define T0IP                          1172
#define INTEDG3                       1173
#define INTEDG2                       1174
#define INTEDG1                       1175
#define INTEDG0                       1176
#define RBPU                          1177
#define NOT_RBPU                      1178
#define nRBPU                         1179
#define INTCON                        1180
#define RBIF                          1181
#define INT0F                         1182
#define INT0IF                        1183
#define T0IF                          1184
#define TMR0IF                        1185
#define RBIE                          1186
#define INT0E                         1187
#define INT0IE                        1188
#define T0IE                          1189
#define TMR0IE                        1190
#define PEIE                          1191
#define PEIE_GIEL                     1192
#define GIEL                          1193
#define GIE_GIEH                      1194
#define GIE                           1195
#define GIEH                          1196
#define STKPTR0                       1197
#define STKPTR                        1198
#define SP0                           1199
#define STKPTR1                       1200
#define SP1                           1201
#define STKPTR2                       1202
#define SP2                           1203
#define SP3                           1204
#define STKPTR3                       1205
#define STKPTR4                       1206
#define SP4                           1207
#define STKUNF                        1208
#define STKOVF                        1209
#define STKFUL                        1210

#endif // _PIC18F65J15_H_
